## Conexión con MySQL

In [7]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
database_type = 'pymysql'
user = 'root'
password = 'Cooperboy0071985'
host = 'localhost'
database = 'mysql7'
engine = create_engine(f'mysql+{database_type}://{user}:{password}@{host}/{database}', echo=False) 
#engine = create_engine('mysql+pymysql://root:Cooperboy0071985@localhost/mysql7', echo=False)  #Resumido

In [24]:
conn = engine.connect()

In [25]:
sql = 'select * from sample_database'

In [26]:
df = pd.read_sql(sql, conn)

In [27]:
df.head()

,index,Reason_1,Reason_2,Reason_3,Reason_4,Month Value,Transportation Expense,Age,Body Mass Index,Education,Children,Pet,Probability,Prediction
0,0,0,0.0,0,1,6,179,30,19,1,0,0,0.127464,0
1,1,1,0.0,0,0,6,361,28,27,0,1,4,0.864161,1
2,2,0,0.0,0,1,6,155,34,25,0,2,0,0.267152,0
3,3,0,0.0,0,1,6,179,40,22,1,2,0,0.200487,0
4,4,1,0.0,0,0,6,155,34,25,0,2,0,0.722014,1

In [32]:
df.to_sql('Absenteeism', con=engine, if_exists='append', index=False, chunksize=50)

## Conexión con SQL Server

In [9]:
username = 'sa'
password = 'Cooperboy0071985'
server = 'DESKTOP-GBM1V5B'
database = 'Northwind'
driver = 'SQL Server Native Client 11.0'
engine = create_engine(f'mssql://{username}:{password}@{server}/{database}?driver={driver}')
#engine = create_engine('mssql://sa:Cooperboy0071985@DESKTOP-GBM1V5B/Northwind?driver=SQL Server Native Client 11.0')   #Resumen

In [10]:
conn = engine.connect()

In [17]:
sql = 'select * from Orders'

In [18]:
df2 = pd.read_sql(sql, conn)

In [19]:
df2.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium

In [21]:
df2.to_sql('Orders2', con=engine, if_exists='append', index=False, chunksize=50)

## Conexión con SQLAzure

In [9]:
server = "sqlplatziserver"
port = 1433
user = "rodrigocooper"
password = "Cooperboy0071985"
database = "registrosprueba"
engine = create_engine(f'mssql+pyodbc://{user}@{server}:{password}@{server}.database.windows.net:{port}/{database}?driver=ODBC+Driver+13+for+SQL+Server')

In [10]:
conn = engine.connect()

In [13]:
sql = 'select * from [SalesLT].[SalesOrderDetail]'

In [14]:
df3 = pd.read_sql(sql, conn)

In [16]:
df3.head()

,SalesOrderID,SalesOrderDetailID,OrderQty,ProductID,UnitPrice,UnitPriceDiscount,LineTotal,rowguid,ModifiedDate
0,71774,110562,1,836,356.898,0.0,356.898,E3A1994C-7A68-4CE8-96A3-77FDD3BBD730,2008-06-01
1,71774,110563,1,822,356.898,0.0,356.898,5C77F557-FDB6-43BA-90B9-9A7AEC55CA32,2008-06-01
2,71776,110567,1,907,63.900,0.0,63.900,6DBFE398-D15D-425E-AA58-88178FE360E5,2008-06-01
3,71780,110616,4,905,218.454,0.0,873.816,377246C9-4483-48ED-A5B9-E56F005364E0,2008-06-01
4,71780,110617,2,983,461.694,0.0,923.388,43A54BCD-536D-4A1B-8E69-24D083507A14,2008-06-01

In [17]:
df3.to_sql('Orders3', con=engine, if_exists='append', index=False, chunksize=50)